In [1]:
import numpy as np
import pandas as pd

In [2]:
a = np.array([1,2,3])
print(a)

[1 2 3]

In [3]:
dict = {
    'name' :['hassam', 'minhaj'],
    ' age' : [22,18]
}
df = pd.DataFrame(dict)
df

     name   age
0  hassam    22
1  minhaj    18

In [ ]:
import pandas as pd
import numpy as np

newdf = pd.DataFrame(np.random.rand(100, 5), index=np.arange(100))
newdf.at[0, 0] = "hassam"
print(newdf)

In [ ]:
newdf.to_numpy()

In [ ]:
newdf.at[0,0] = 0.6
newdf

In [ ]:
import pandas as pd

data = {
    'A': [1, 2, 3, 4, 5, 6],
    'B': [7, 8, 9, 10, 11, 12]
}


index = ['a', 'b', 'c', 'd', 'e', 'f']
newdf.head()

In [ ]:
newdf.describe()

In [ ]:
newdf.at['a','A'] = 69
newdf.head()

In [ ]:
newdf.drop(0, axis = 1)
newdf.head()

In [ ]:
newdf.loc[(newdf['A']>4)]

In [ ]:
new_index = [1, 2, 3, 4, 5, 6]

newdf.index = new_index

print(newdf)

In [ ]:
newdf.iloc[0,1]

In [5]:
newdatabase = {
    'name' : ['hassam', 'minhaj', 'khizer', ' areeb'],
    'age' : [22,18,17,16],
     'role' : ["opener", 'bowler', 'allrounder', 'spinner']
}
newdatabase = pd.DataFrame(newdatabase)

index = [1,2,3,4]
print(newdatabase)

     name  age        role
0  hassam   22      opener
1  minhaj   18      bowler
2  khizer   17  allrounder
3   areeb   16     spinner

In [6]:
newdatabase.head()

     name  age        role
0  hassam   22      opener
1  minhaj   18      bowler
2  khizer   17  allrounder
3   areeb   16     spinner

In [11]:
newdatabase.head()

     name  age        role
0  muneeb   22      opener
1  muneeb   18      bowler
2  muneeb   17  allrounder
3  muneeb   16     spinner

In [12]:
newdatabase["name"] = ["Hassam", 'Minhaj', 'Areeb', 'Khizer']
newdatabase

     name  age        role
0  Hassam   22      opener
1  Minhaj   18      bowler
2   Areeb   17  allrounder
3  Khizer   16     spinner

In [13]:
newindexx = [1,2,3,4]
newdatabase.index = newindexx
newindexx

[1, 2, 3, 4]

In [14]:
newdatabase.head()

     name  age        role
1  Hassam   22      opener
2  Minhaj   18      bowler
3   Areeb   17  allrounder
4  Khizer   16     spinner

In [15]:
newdatabase.dropna(how= 'all', axis = 1)

     name  age        role
1  Hassam   22      opener
2  Minhaj   18      bowler
3   Areeb   17  allrounder
4  Khizer   16     spinner

In [22]:
newdatabase['name'].value_counts(dropna = False)

name
Hassam    1
Minhaj    1
Areeb     1
Khizer    1
Name: count, dtype: int64

In [23]:
newdatabase.max()

name     Minhaj
age          22
role    spinner
dtype: object

In [24]:
newdatabase.min()

name         Areeb
age             16
role    allrounder
dtype: object

In [28]:
newdatabase.count()

name    4
age     4
role    4
dtype: int64